{
    "class_name": "Sequential",
    "config": {
        "name": "sequential_11",
        "layers": [
            {
                "class_name": "Sequential",
                "config": {
                    "name": "sequential_5",
                    "layers": [
                        {
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2d_9",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 32,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            }
                        },
                        {
                            "class_name": "MaxPooling2D",
                            "config": {
                                "name": "max_pooling2d",
                                "trainable": true,
                                "dtype": "float32",
                                "pool_size": [
                                    2,
                                    2
                                ],
                                "padding": "valid",
                                "strides": [
                                    2,
                                    2
                                ],
                                "data_format": "channels_last"
                            }
                        },
                        {
                            "class_name": "LeakyReLU",
                            "config": {
                                "name": "leaky_re_lu_23",
                                "trainable": true,
                                "dtype": "float32",
                                "alpha": 0.30000001192092896
                            }
                        },
                        {
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2d_10",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 32,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            }
                        },
                        {
                            "class_name": "LeakyReLU",
                            "config": {
                                "name": "leaky_re_lu_24",
                                "trainable": true,
                                "dtype": "float32",
                                "alpha": 0.30000001192092896
                            }
                        },
                        {
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2d_11",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 32,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            }
                        },
                        {
                            "class_name": "LeakyReLU",
                            "config": {
                                "name": "leaky_re_lu_25",
                                "trainable": true,
                                "dtype": "float32",
                                "alpha": 0.30000001192092896
                            }
                        },
                        {
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2d_12",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 64,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            }
                        },
                        {
                            "class_name": "MaxPooling2D",
                            "config": {
                                "name": "max_pooling2d_1",
                                "trainable": true,
                                "dtype": "float32",
                                "pool_size": [
                                    2,
                                    2
                                ],
                                "padding": "valid",
                                "strides": [
                                    2,
                                    2
                                ],
                                "data_format": "channels_last"
                            }
                        },
                        {
                            "class_name": "LeakyReLU",
                            "config": {
                                "name": "leaky_re_lu_26",
                                "trainable": true,
                                "dtype": "float32",
                                "alpha": 0.30000001192092896
                            }
                        },
                        {
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2d_13",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 64,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            }
                        },
                        {
                            "class_name": "LeakyReLU",
                            "config": {
                                "name": "leaky_re_lu_27",
                                "trainable": true,
                                "dtype": "float32",
                                "alpha": 0.30000001192092896
                            }
                        },
                        {
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2d_14",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 64,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            }
                        },
                        {
                            "class_name": "LeakyReLU",
                            "config": {
                                "name": "leaky_re_lu_28",
                                "trainable": true,
                                "dtype": "float32",
                                "alpha": 0.30000001192092896
                            }
                        }
                    ],
                    "build_input_shape": [
                        null,
                        32,
                        32,
                        3
                    ]
                }
            },
            {
                "class_name": "Sequential",
                "config": {
                    "name": "sequential_6",
                    "layers": [
                        {
                            "class_name": "Conv2DTranspose",
                            "config": {
                                "name": "conv2d_transpose_14",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 64,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null,
                                "output_padding": null
                            }
                        },
                        {
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "batch_normalization_14",
                                "trainable": true,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "gamma_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "moving_mean_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "moving_variance_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null
                            }
                        },
                        {
                            "class_name": "LeakyReLU",
                            "config": {
                                "name": "leaky_re_lu_29",
                                "trainable": true,
                                "dtype": "float32",
                                "alpha": 0.30000001192092896
                            }
                        },
                        {
                            "class_name": "Conv2DTranspose",
                            "config": {
                                "name": "conv2d_transpose_15",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 64,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null,
                                "output_padding": null
                            }
                        },
                        {
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "batch_normalization_15",
                                "trainable": true,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "gamma_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "moving_mean_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "moving_variance_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null
                            }
                        },
                        {
                            "class_name": "LeakyReLU",
                            "config": {
                                "name": "leaky_re_lu_30",
                                "trainable": true,
                                "dtype": "float32",
                                "alpha": 0.30000001192092896
                            }
                        },
                        {
                            "class_name": "Conv2DTranspose",
                            "config": {
                                "name": "conv2d_transpose_16",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 64,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null,
                                "output_padding": null
                            }
                        },
                        {
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "batch_normalization_16",
                                "trainable": true,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "gamma_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "moving_mean_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "moving_variance_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null
                            }
                        },
                        {
                            "class_name": "UpSampling2D",
                            "config": {
                                "name": "up_sampling2d",
                                "trainable": true,
                                "dtype": "float32",
                                "size": [
                                    2,
                                    2
                                ],
                                "data_format": "channels_last",
                                "interpolation": "nearest"
                            }
                        },
                        {
                            "class_name": "LeakyReLU",
                            "config": {
                                "name": "leaky_re_lu_31",
                                "trainable": true,
                                "dtype": "float32",
                                "alpha": 0.30000001192092896
                            }
                        },
                        {
                            "class_name": "Conv2DTranspose",
                            "config": {
                                "name": "conv2d_transpose_17",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 32,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null,
                                "output_padding": null
                            }
                        },
                        {
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "batch_normalization_17",
                                "trainable": true,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "gamma_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "moving_mean_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "moving_variance_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null
                            }
                        },
                        {
                            "class_name": "LeakyReLU",
                            "config": {
                                "name": "leaky_re_lu_32",
                                "trainable": true,
                                "dtype": "float32",
                                "alpha": 0.30000001192092896
                            }
                        },
                        {
                            "class_name": "Conv2DTranspose",
                            "config": {
                                "name": "conv2d_transpose_18",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 32,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null,
                                "output_padding": null
                            }
                        },
                        {
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "batch_normalization_18",
                                "trainable": true,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "gamma_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "moving_mean_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "moving_variance_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null
                            }
                        },
                        {
                            "class_name": "LeakyReLU",
                            "config": {
                                "name": "leaky_re_lu_33",
                                "trainable": true,
                                "dtype": "float32",
                                "alpha": 0.30000001192092896
                            }
                        },
                        {
                            "class_name": "Conv2DTranspose",
                            "config": {
                                "name": "conv2d_transpose_19",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 32,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null,
                                "output_padding": null
                            }
                        },
                        {
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "batch_normalization_19",
                                "trainable": true,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "gamma_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "moving_mean_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "moving_variance_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null
                            }
                        },
                        {
                            "class_name": "UpSampling2D",
                            "config": {
                                "name": "up_sampling2d_1",
                                "trainable": true,
                                "dtype": "float32",
                                "size": [
                                    2,
                                    2
                                ],
                                "data_format": "channels_last",
                                "interpolation": "nearest"
                            }
                        },
                        {
                            "class_name": "LeakyReLU",
                            "config": {
                                "name": "leaky_re_lu_34",
                                "trainable": true,
                                "dtype": "float32",
                                "alpha": 0.30000001192092896
                            }
                        },
                        {
                            "class_name": "Conv2DTranspose",
                            "config": {
                                "name": "conv2d_transpose_20",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 16,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null,
                                "output_padding": null
                            }
                        },
                        {
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "batch_normalization_20",
                                "trainable": true,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "gamma_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "moving_mean_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "moving_variance_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null
                            }
                        },
                        {
                            "class_name": "LeakyReLU",
                            "config": {
                                "name": "leaky_re_lu_35",
                                "trainable": true,
                                "dtype": "float32",
                                "alpha": 0.30000001192092896
                            }
                        },
                        {
                            "class_name": "Conv2DTranspose",
                            "config": {
                                "name": "conv2d_transpose_21",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 16,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null,
                                "output_padding": null
                            }
                        },
                        {
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "batch_normalization_21",
                                "trainable": true,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "gamma_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "moving_mean_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "moving_variance_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null
                            }
                        },
                        {
                            "class_name": "LeakyReLU",
                            "config": {
                                "name": "leaky_re_lu_36",
                                "trainable": true,
                                "dtype": "float32",
                                "alpha": 0.30000001192092896
                            }
                        },
                        {
                            "class_name": "Conv2DTranspose",
                            "config": {
                                "name": "conv2d_transpose_22",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 16,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
