{
    "class_name": "Sequential",
    "config": {
        "name": "sequential_10",
        "layers": [
            {
                "class_name": "Sequential",
                "config": {
                    "name": "sequential",
                    "layers": [
                        {
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2d",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 32,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            }
                        },
                        {
                            "class_name": "LeakyReLU",
                            "config": {
                                "name": "leaky_re_lu",
                                "trainable": true,
                                "dtype": "float32",
                                "alpha": 0.30000001192092896
                            }
                        },
                        {
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2d_1",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 32,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    2,
                                    2
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            }
                        },
                        {
                            "class_name": "LeakyReLU",
                            "config": {
                                "name": "leaky_re_lu_1",
                                "trainable": true,
                                "dtype": "float32",
                                "alpha": 0.30000001192092896
                            }
                        },
                        {
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2d_2",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 32,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            }
                        },
                        {
                            "class_name": "LeakyReLU",
                            "config": {
                                "name": "leaky_re_lu_2",
                                "trainable": true,
                                "dtype": "float32",
                                "alpha": 0.30000001192092896
                            }
                        }
                    ],
                    "build_input_shape": [
                        null,
                        32,
                        32,
                        3
                    ]
                }
            },
            {
                "class_name": "Sequential",
                "config": {
                    "name": "sequential_1",
                    "layers": [
                        {
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2d_3",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 64,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            }
                        },
                        {
                            "class_name": "LeakyReLU",
                            "config": {
                                "name": "leaky_re_lu_3",
                                "trainable": true,
                                "dtype": "float32",
                                "alpha": 0.30000001192092896
                            }
                        },
                        {
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2d_4",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 64,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    2,
                                    2
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            }
                        },
                        {
                            "class_name": "LeakyReLU",
                            "config": {
                                "name": "leaky_re_lu_4",
                                "trainable": true,
                                "dtype": "float32",
                                "alpha": 0.30000001192092896
                            }
                        },
                        {
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2d_5",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 64,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            }
                        },
                        {
                            "class_name": "LeakyReLU",
                            "config": {
                                "name": "leaky_re_lu_5",
                                "trainable": true,
                                "dtype": "float32",
                                "alpha": 0.30000001192092896
                            }
                        },
                        {
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2d_6",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 128,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            }
                        },
                        {
                            "class_name": "LeakyReLU",
                            "config": {
                                "name": "leaky_re_lu_6",
                                "trainable": true,
                                "dtype": "float32",
                                "alpha": 0.30000001192092896
                            }
                        },
                        {
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2d_7",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 128,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    2,
                                    2
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            }
                        },
                        {
                            "class_name": "LeakyReLU",
                            "config": {
                                "name": "leaky_re_lu_7",
                                "trainable": true,
                                "dtype": "float32",
                                "alpha": 0.30000001192092896
                            }
                        },
                        {
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2d_8",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 128,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            }
                        },
                        {
                            "class_name": "LeakyReLU",
                            "config": {
                                "name": "leaky_re_lu_8",
                                "trainable": true,
                                "dtype": "float32",
                                "alpha": 0.30000001192092896
                            }
                        }
                    ],
                    "build_input_shape": [
                        null,
                        16,
                        16,
                        32
                    ]
                }
            },
            {
                "class_name": "Sequential",
                "config": {
                    "name": "sequential_2",
                    "layers": [
                        {
                            "class_name": "Conv2DTranspose",
                            "config": {
                                "name": "conv2d_transpose",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 128,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null,
                                "output_padding": null
                            }
                        },
                        {
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "batch_normalization",
                                "trainable": true,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "gamma_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "moving_mean_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "moving_variance_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null
                            }
                        },
                        {
                            "class_name": "LeakyReLU",
                            "config": {
                                "name": "leaky_re_lu_9",
                                "trainable": true,
                                "dtype": "float32",
                                "alpha": 0.30000001192092896
                            }
                        },
                        {
                            "class_name": "Conv2DTranspose",
                            "config": {
                                "name": "conv2d_transpose_1",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 128,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    2,
                                    2
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null,
                                "output_padding": null
                            }
                        },
                        {
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "batch_normalization_1",
                                "trainable": true,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "gamma_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "moving_mean_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "moving_variance_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null
                            }
                        },
                        {
                            "class_name": "LeakyReLU",
                            "config": {
                                "name": "leaky_re_lu_10",
                                "trainable": true,
                                "dtype": "float32",
                                "alpha": 0.30000001192092896
                            }
                        },
                        {
                            "class_name": "Conv2DTranspose",
                            "config": {
                                "name": "conv2d_transpose_2",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 128,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null,
                                "output_padding": null
                            }
                        },
                        {
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "batch_normalization_2",
                                "trainable": true,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "gamma_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "moving_mean_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "moving_variance_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null
                            }
                        },
                        {
                            "class_name": "LeakyReLU",
                            "config": {
                                "name": "leaky_re_lu_11",
                                "trainable": true,
                                "dtype": "float32",
                                "alpha": 0.30000001192092896
                            }
                        },
                        {
                            "class_name": "Conv2DTranspose",
                            "config": {
                                "name": "conv2d_transpose_3",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 64,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null,
                                "output_padding": null
                            }
                        },
                        {
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "batch_normalization_3",
                                "trainable": true,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "gamma_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "moving_mean_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "moving_variance_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null
                            }
                        },
                        {
                            "class_name": "LeakyReLU",
                            "config": {
                                "name": "leaky_re_lu_12",
                                "trainable": true,
                                "dtype": "float32",
                                "alpha": 0.30000001192092896
                            }
                        },
                        {
                            "class_name": "Conv2DTranspose",
                            "config": {
                                "name": "conv2d_transpose_4",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 64,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    2,
                                    2
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null,
                                "output_padding": null
                            }
                        },
                        {
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "batch_normalization_4",
                                "trainable": true,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "gamma_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "moving_mean_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "moving_variance_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null
                            }
                        },
                        {
                            "class_name": "LeakyReLU",
                            "config": {
                                "name": "leaky_re_lu_13",
                                "trainable": true,
                                "dtype": "float32",
                                "alpha": 0.30000001192092896
                            }
                        },
                        {
                            "class_name": "Conv2DTranspose",
                            "config": {
                                "name": "conv2d_transpose_5",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 64,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null,
                                "output_padding": null
                            }
                        },
                        {
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "batch_normalization_5",
                                "trainable": true,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "gamma_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "moving_mean_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "moving_variance_initializer": {
                                    "class_name": "Ones",
                                    "config": {}
                                },
                                "beta_regularizer": null,
                                "gamma_regularizer": null,
                                "beta_constraint": null,
                                "gamma_constraint": null
                            }
                        },
                        {
                            "class_name": "LeakyReLU",
                            "config": {
                                "name": "leaky_re_lu_14",
                                "trainable": true,
                                "dtype": "float32",
                                "alpha": 0.30000001192092896
                            }
                        }
                    ],
                    "build_input_shape": [
                        null,
                        4,
                        4,
                        128
                    ]
                }
            },
            {
                "class_name": "Sequential",
                "config": {
                    "name": "sequential_4",
                    "layers": [
                        {
                            "class_name": "Conv2DTranspose",
                            "config": {
                                "name": "conv2d_transpose_10",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 32,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": false,
                                "kernel_initializer": {
                                    "class_name": "GlorotUniform",
                                    "config": {
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null,
                                "output_padding": null
                            }
                        },
                        {
                            "class_name": "BatchNormalization",
                            "config": {
                                "name": "batch_normalization_10",
                                "trainable": true,
                                "dtype": "float32",
                                "axis": [
                                    3
                                ],
                                "momentum": 0.99,
                                "epsilon": 0.001,
                                "center": true,
                                "scale": true,
                                "beta_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "gamma_initializer": {
